
<?php
$side = 7;
$p = $side * 4;
$s = $side * $side;
echo $s . '**' . $p . '<br>';

$km = 10;
$m = $km * 1000;
echo '***' . $m . '<br>';

$a = 200;
$b = 120;
if ($a > $b) {
    echo '***' . $a . ' بزرگترین <br>';
} else {
    echo '***' . $b . 'بزرگترین <br>';
}

$a = 10;
$b = 11;
$c = 1;
if ($a > $b && $a > $c) {
    echo $a . '<br>بزرگترین';
} elseif ($b > $a && $b > $c) {
    echo $b . 'بزرگترین<br>';
} else {
    echo $c . 'بزرگترین<br>';
}

$a = 10;
$b = 20;
if ($a > $b) {
    $عددبزرگتر = $a && $عددکوچکتر = $b;
} else {
    $عددبزرگتر = $b && $عددکوچکتر = $a;
}
$n = $عددبزرگتر % $عددکوچکتر;
if ($n == 0) {
    echo 'عدد کوچکتر مقسوم علیه عدد بزرگ است<br>';
} else {
    echo 'عدد کوچکتر مقسوم علیه عدد بزرگ نیست <br>';
}

$a = 4;
$sum = 0;
for ($x = 1;$x <= $a;$x++) {
    $sum = $sum + $x;
}
echo $sum . '<br>';

$birth = 1380;
$age = 1404 - $birth;
if ($age > 18) {
    echo 'شما میتوانید رای دهید<br>';
} else {
    echo 'شما نمیتوانید رای دهید <br>';
} 

$y=2;
$x=0;
$n=1;
$a=$x+$n;
while ($a<$y) {
    $x=$n;
    $n=$a;
    $a=$x+$n;
}
if ($a==$y) {
    echo 'عدد جز سری فیبوناچی است <br>';
}
 else  {echo 'عدد جز سری فیبوناچی نیست<br>';}
?>
